docs/org/client.org
#+TITLE: Client Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: client
#+HUGO_TYPE: docs
#+HUGO_PAIRED_SHORTCODES: tip 

** Quick Start
   :PROPERTIES:
   :EXPORT_FILE_NAME: quick
   :EXPORT_HUGO_WEIGHT: 310
   :END:

   A quick overview of some of the features is described in the following tasks:

*** Create
- Click on the @@hugo:{{< icon "client/icons/CreateProcess.png" "create process icon" "inline" >}}@@ ~Create Process~ icon.
- Double click on the /process box/ labelled ~P1~ to *rename the process*.
- Double click on one of the /edges/ (initially labelled ~X~) to *rename the corresponding resource*.
- Double click on one of the small, /resource circles/ to *add a new branch*.
- Right-click on one of the small, /resource circles/ to *add a branch of different type*  (from parallel to optional and vice-versa) or to *delete a branch*.

*** Compose 
- Open a *new workspace* with the @@hugo:{{< icon "client/icons/CreateWorkspace.png" "create workspace icon" "inline" >}}@@ ~Create Workspace~ icon.
- Double click on a /process/ in the ~Processes~ list on the left to *add its graph to the workspace*.
- Compose processes *in sequence* by selecting (clicking) an /output resource/ (edge or circle) and then *right-clicking* an /input resource/ with the same name belonging to a different process.
- Compose processes *in parallel* by selecting (clicking) a /process box/ then *right-clicking* /another process box/.
- Compose processes *conditionally* by selecting (clicking) an /input resource/ (edge or circle) and then *right-clicking* another /input resource/ belonging to different process.
- Right click on a /process box/ and select @@hugo:{{< icon "client/icons/Composite.png" "composite process icon" "inline" >}}@@ ~Store Composition~ to collapse and *store a composite proces*s as a reusable composite component under a new name.

*** Edit & Verify
- Right click on a /process/ in the ~Processes~ list on the left.
- Select @@hugo:{{< icon "client/icons/EditProcess.png" "edit process icon" "inline" >}}@@ ~Edit Process~ to *change the specification* of an /atomic/ process.
- Select @@hugo:{{< icon "client/icons/Delete.png" "delete icon" "inline" >}}@@ ~Delete Process~ to delete a process.
- Changing or deleting a process specification affects all composite processes that depend on it. These become *unverified*: @@hugo:{{< icon "client/icons/CompositeWarning.png" "composite process warning icon" "inline" >}}@@.
- Right click on an /unverified process/ and select @@hugo:{{< icon "client/icons/VerifyParents.png" "verify process&parents icon" "inline" >}}@@ ~Verify Process&Parents~ to *rerun and verify the composition*.


